## 간단한 함수 만들기

In [1]:
def my_sq(x):
    return x ** 2

In [3]:
def my_exp(x, n):
    return x ** n

In [6]:
print(my_sq(4))
print(my_exp(2, 5))

16
32

In [7]:
import pandas as pd

In [8]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})
print(df)

    a   b
0  10  20
1  20  30
2  30  40

#### apply 메소드 사용하기 - 기초

In [11]:
sq = df['a'].apply(my_sq)
print(sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [12]:
df['a'].apply(lambda x : x ** 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [14]:
ex = df['a'].apply(my_exp, n = 2)
print(ex)

0    100
1    400
2    900
Name: a, dtype: int64

In [17]:
df['a'].apply(lambda x, n : x **n, n=3)
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [18]:
def print_me(x):
    print(x)

In [19]:
df.apply(print_me, axis=0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [20]:
df.apply(print_me, axis=1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [21]:
df.apply(lambda x : x['a'] + x['b'], axis= 1)

0    30
1    50
2    70
dtype: int64

- 데이터프레임에 apply 메소드 사용

In [22]:
def avg_3(x,y,z):
    return(x+y+z)/3

In [24]:
print(df.apply(avg_3, y=1,z=2))

           a          b
0   4.333333   7.666667
1   7.666667  11.000000
2  11.000000  14.333333

In [26]:
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x+y+z) / 3

In [27]:
print(df.apply(avg_3_apply))

a    20.0
b    30.0
dtype: float64

In [33]:
import seaborn as sns

In [34]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [35]:
import numpy as np

In [39]:
def count_missing(vec):
    null_vec= pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

cmis_col = titanic.apply(count_missing)

print(cmis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [40]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num / dem

pmis_col = titanic.apply(prop_missing)
print(pmis_col)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64